SiliconLabs/arduino/boards.txt
# Silicon Labs Arduino Core - board definitions
###############################################


##################################
# SparkFun Thing Plus Matter (BLE)
# OPN: brd2704a
##################################

thingplusmatter_ble.name=SparkFun Thing Plus Matter (BLE)
thingplusmatter_ble.upload.tool=simplicitycommander
thingplusmatter_ble.upload.tool.default=simplicitycommander
thingplusmatter_ble.upload.target=sparkfunthingplus
thingplusmatter_ble.upload.maximum_data_size=262144
thingplusmatter_ble.upload.maximum_size=1572864
thingplusmatter_ble.upload.protocol=jlink
thingplusmatter_ble.upload.setup_command=
thingplusmatter_ble.upload.use_1200bps_touch=false
thingplusmatter_ble.upload.wait_for_upload_port=false
thingplusmatter_ble.upload.native_usb=false
thingplusmatter_ble.bootloader.tool=simplicitycommander
thingplusmatter_ble.bootloader.tool.default=simplicitycommander
thingplusmatter_ble.bootloader.file=sparkfun-thingplus-ble-bootloader-apploader.hex
thingplusmatter_ble.build.mcu=cortex-m33
thingplusmatter_ble.build.f_cpu=39000000
thingplusmatter_ble.build.board=SILABS_THINGPLUSMATTER_BLE
thingplusmatter_ble.build.core=silabs
thingplusmatter_ble.build.variant=thingplusmatter_ble
thingplusmatter_ble.build.variant_system_lib=
thingplusmatter_ble.gsdk_folder=gecko_sdk_4.3.2
thingplusmatter_ble.build.gsdk_path={build.variant.path}/{gsdk_folder}
thingplusmatter_ble.build.precompiled_gsdk=

thingplusmatter_ble.build.include_list="-I{build.variant.path}/config" "-I{build.variant.path}/autogen" "-I{build.variant.path}" "-I{build.gsdk_path}/platform/Device/SiliconLabs/MGM24/Include" "-I{build.gsdk_path}/app/common/util/app_assert" "-I{build.gsdk_path}/app/common/util/app_log" "-I{build.gsdk_path}/protocol/bluetooth/inc" "-I{build.gsdk_path}/platform/common/inc" "-I{build.gsdk_path}/protocol/bluetooth/bgstack/ll/inc" "-I{build.gsdk_path}/hardware/board/inc" "-I{build.gsdk_path}/platform/bootloader" "-I{build.gsdk_path}/platform/bootloader/api" "-I{build.gsdk_path}/platform/CMSIS/Core/Include" "-I{build.gsdk_path}/platform/CMSIS/RTOS2/Include" "-I{build.gsdk_path}/hardware/driver/configuration_over_swo/inc" "-I{build.gsdk_path}/platform/driver/debug/inc" "-I{build.gsdk_path}/platform/service/device_init/inc" "-I{build.gsdk_path}/platform/emdrv/dmadrv/inc" "-I{build.gsdk_path}/platform/emdrv/common/inc" "-I{build.gsdk_path}/platform/emlib/inc" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/fem_util" "-I{build.gsdk_path}/util/third_party/freertos/cmsis/Include" "-I{build.gsdk_path}/util/third_party/freertos/kernel/include" "-I{build.gsdk_path}/util/third_party/freertos/kernel/portable/GCC/ARM_CM33_NTZ/non_secure" "-I{build.gsdk_path}/platform/service/hfxo_manager/inc" "-I{build.gsdk_path}/platform/driver/i2cspm/inc" "-I{build.gsdk_path}/platform/service/iostream/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/config" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/config/preset" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/inc" "-I{build.gsdk_path}/util/third_party/mbedtls/include" "-I{build.gsdk_path}/util/third_party/mbedtls/library" "-I{build.gsdk_path}/platform/service/mpu/inc" "-I{build.gsdk_path}/platform/emdrv/nvm3/inc" "-I{build.gsdk_path}/platform/peripheral/inc" "-I{build.gsdk_path}/platform/service/power_manager/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_psa_driver/inc" "-I{build.gsdk_path}/platform/radio/rail_lib/common" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/ble" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/ieee802154" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/wmbus" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/zwave" "-I{build.gsdk_path}/platform/radio/rail_lib/chip/efr32/efr32xg2x" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/pa-conversions" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/pa-conversions/efr32xg24" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_power_manager_init" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_pti" "-I{build.gsdk_path}/platform/security/sl_component/se_manager/inc" "-I{build.gsdk_path}/platform/security/sl_component/se_manager/src" "-I{build.gsdk_path}/util/silicon_labs/silabs_core/memory_manager" "-I{build.gsdk_path}/platform/common/toolchain/inc" "-I{build.gsdk_path}/platform/service/system/inc" "-I{build.gsdk_path}/platform/service/sleeptimer/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_protocol_crypto/src" "-I{build.gsdk_path}/platform/emdrv/spidrv/inc" "-I{build.gsdk_path}/platform/service/udelay/inc" "-I{build.gsdk_path}/platform/driver/pwm/inc" "-I{build.gsdk_path}/platform/emdrv/gpiointerrupt/inc"

thingplusmatter_ble.build.precompiled_libs="{build.gsdk_path}/protocol/bluetooth/lib/EFR32XG24/GCC/libbluetooth.a" "{build.gsdk_path}/platform/emdrv/nvm3/lib/libnvm3_CM33_gcc.a" "{build.gsdk_path}/platform/radio/rail_lib/autogen/librail_release/librail_config_mgm240pb32vna_gcc.a" "{build.gsdk_path}/platform/radio/rail_lib/autogen/librail_release/librail_module_efr32xg24_gcc_release.a"

thingplusmatter_ble.build.board_specific_macros='-DNUM_LEDS=1' '-DLED_BUILTIN=PA8' '-DNUM_HW_SERIAL=2' '-DNUM_HW_SPI=2' '-DNUM_DAC_HW=1' '-DARDUINO_MAIN_TASK_STACK_SIZE=2048'

thingplusmatter_ble.build.extra_flags={build.board_specific_macros} '-DMGM240PB32VNA=1' '-DSL_APP_PROPERTIES=1' '-DBOOTLOADER_APPLOADER=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD2704A"' '-DSL_BOARD_REV="A00"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=0' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1'

thingplusmatter_ble.build.float_flags=

thingplusmatter_ble.build.s_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -imacros sl_gcc_preinclude.h -x assembler-with-cpp -c -g

thingplusmatter_ble.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c99 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

