SiliconLabs/arduino/boards.txt
thingplusmatter_ble.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c++11 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

thingplusmatter_ble.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map={build.path}/{build.project_name}.map -Wl,--gc-sections

thingplusmatter_ble.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

thingplusmatter_ble.build.ldscript={build.variant.path}/autogen/linkerfile.ld


##########################################################
# SparkFun Thing Plus Matter (BLE) - with precompiled GSDK
# OPN: brd2704a
##########################################################

thingplusmatter_ble_precomp.name=SparkFun Thing Plus Matter (BLE) (precomp)
thingplusmatter_ble_precomp.upload.tool=simplicitycommander
thingplusmatter_ble_precomp.upload.tool.default=simplicitycommander
thingplusmatter_ble_precomp.upload.target=sparkfunthingplus
thingplusmatter_ble_precomp.upload.maximum_data_size=262144
thingplusmatter_ble_precomp.upload.maximum_size=1572864
thingplusmatter_ble_precomp.upload.protocol=jlink
thingplusmatter_ble_precomp.upload.setup_command=
thingplusmatter_ble_precomp.upload.use_1200bps_touch=false
thingplusmatter_ble_precomp.upload.wait_for_upload_port=false
thingplusmatter_ble_precomp.upload.native_usb=false
thingplusmatter_ble_precomp.bootloader.tool=simplicitycommander
thingplusmatter_ble_precomp.bootloader.tool.default=simplicitycommander
thingplusmatter_ble_precomp.bootloader.file=sparkfun-thingplus-ble-bootloader-apploader.hex
thingplusmatter_ble_precomp.build.mcu=cortex-m33
thingplusmatter_ble_precomp.build.f_cpu=39000000
thingplusmatter_ble_precomp.build.board=SILABS_THINGPLUSMATTER_BLE
thingplusmatter_ble_precomp.build.core=silabs
thingplusmatter_ble_precomp.build.variant=thingplusmatter_ble_precomp
thingplusmatter_ble_precomp.build.variant_system_lib=
thingplusmatter_ble_precomp.build.gsdk_path=
thingplusmatter_ble_precomp.build.precompiled_gsdk="{build.variant.path}/gsdk/gsdk.a"

thingplusmatter_ble_precomp.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/gsdk/include"

thingplusmatter_ble_precomp.build.precompiled_libs="{build.variant.path}/gsdk/libbluetooth.a" "{build.variant.path}/gsdk/libnvm3_CM33_gcc.a" "{build.variant.path}/gsdk/librail_config_mgm240pb32vna_gcc.a" "{build.variant.path}/gsdk/librail_module_efr32xg24_gcc_release.a"

thingplusmatter_ble_precomp.build.board_specific_macros='-DNUM_LEDS=1' '-DLED_BUILTIN=PA8' '-DNUM_HW_SERIAL=2' '-DNUM_HW_SPI=2' '-DNUM_DAC_HW=1' '-DARDUINO_MAIN_TASK_STACK_SIZE=2048'

thingplusmatter_ble_precomp.build.extra_flags={build.board_specific_macros} '-DMGM240PB32VNA=1' '-DSL_APP_PROPERTIES=1' '-DBOOTLOADER_APPLOADER=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD2704A"' '-DSL_BOARD_REV="A00"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=0' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1'

thingplusmatter_ble_precomp.build.float_flags=

thingplusmatter_ble_precomp.build.s_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -imacros sl_gcc_preinclude.h -x assembler-with-cpp -c -g

thingplusmatter_ble_precomp.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c99 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

thingplusmatter_ble_precomp.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c++11 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

thingplusmatter_ble_precomp.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map={build.path}/{build.project_name}.map -Wl,--gc-sections

thingplusmatter_ble_precomp.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

thingplusmatter_ble_precomp.build.ldscript={build.variant.path}/gsdk/linkerfile.ld


#####################################
# SparkFun Thing Plus Matter (Matter)
# OPN: brd2704a
#####################################

thingplusmatter_matter.name=SparkFun Thing Plus Matter (Matter)
thingplusmatter_matter.upload.tool=simplicitycommander
thingplusmatter_matter.upload.tool.default=simplicitycommander
thingplusmatter_matter.upload.target=sparkfunthingplus
thingplusmatter_matter.upload.maximum_data_size=262144
thingplusmatter_matter.upload.maximum_size=1572864
thingplusmatter_matter.upload.protocol=jlink
thingplusmatter_matter.upload.setup_command=
thingplusmatter_matter.upload.use_1200bps_touch=false
thingplusmatter_matter.upload.wait_for_upload_port=false
thingplusmatter_matter.upload.native_usb=false
thingplusmatter_matter.bootloader.tool=simplicitycommander
thingplusmatter_matter.bootloader.tool.default=simplicitycommander
thingplusmatter_matter.bootloader.file=sparkfun-thingplus-matter-bootloader-storage-internal-single-512k.hex
thingplusmatter_matter.build.mcu=cortex-m33
thingplusmatter_matter.build.f_cpu=39000000
thingplusmatter_matter.build.board=SILABS_THINGPLUSMATTER_MATTER
thingplusmatter_matter.build.core=silabs
thingplusmatter_matter.build.variant=thingplusmatter_matter
thingplusmatter_matter.build.variant_system_lib=
thingplusmatter_matter.gsdk_folder=gecko_sdk_4.3.2
thingplusmatter_matter.matter_sdk_folder=matter_2.1.1
thingplusmatter_matter.build.gsdk_path={build.variant.path}/{gsdk_folder}
thingplusmatter_matter.build.matter_sdk_path={build.variant.path}/{matter_sdk_folder}
thingplusmatter_matter.build.precompiled_gsdk=

thingplusmatter_matter.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/autogen/zap-generated" "-I{build.variant.path}/autogen/zap-generated/app" "-I{build.variant.path}/config" "-I{build.variant.path}/config/btconf" "-I{build.variant.path}/config/common" "-I{build.variant.path}/autogen" "-I{build.variant.path}/include" "-I{build.matter_sdk_path}/examples/platform/silabs" "-I{build.matter_sdk_path}/src" "-I{build.matter_sdk_path}/src/include" "-I{build.matter_sdk_path}/src/lib" "-I{build.matter_sdk_path}/third_party/nlassert/repo/include" "-I{build.matter_sdk_path}/third_party/nlio/repo/include" "-I{build.matter_sdk_path}/zzz_generated/app-common" "-I{build.matter_sdk_path}/slc/inc" "-I{build.matter_sdk_path}/examples/platform/silabs/efr32" "-I{build.matter_sdk_path}/src/platform/silabs/efr32" "-I{build.matter_sdk_path}/examples/providers" "-I{build.matter_sdk_path}/src/app/clusters/basic-information" "-I{build.matter_sdk_path}/src/app/clusters/color-control-server" "-I{build.matter_sdk_path}/src/app/clusters/diagnostic-logs-server" "-I{build.matter_sdk_path}/src/app/clusters/door-lock-server" "-I{build.matter_sdk_path}/src/app/clusters/general-commissioning-server" "-I{build.matter_sdk_path}/src/app/clusters/general-diagnostics-server" "-I{build.matter_sdk_path}/src/app/clusters/groups-server" "-I{build.matter_sdk_path}/src/app/clusters/identify-server" "-I{build.matter_sdk_path}/src/app/clusters/level-control" "-I{build.matter_sdk_path}/src/app/clusters/network-commissioning" "-I{build.matter_sdk_path}/src/app/clusters/occupancy-sensor-server" "-I{build.matter_sdk_path}/src/app/clusters/on-off-server" "-I{build.matter_sdk_path}/src/app/clusters/ota-requestor" "-I{build.matter_sdk_path}/third_party/silabs/gecko_sdk/util/third_party/segger/systemview/SEGGER" "-I{build.matter_sdk_path}/src/app/clusters/software-diagnostics-server" "-I{build.matter_sdk_path}/src/app/clusters/switch-server" "-I{build.matter_sdk_path}/src/app/clusters/window-covering-server" "-I{build.gsdk_path}/platform/Device/SiliconLabs/MGM24/Include" "-I{build.gsdk_path}/app/common/util/app_assert" "-I{build.gsdk_path}/app/common/util/app_log" "-I{build.gsdk_path}/platform/common/inc" "-I{build.gsdk_path}/protocol/bluetooth/inc" "-I{build.gsdk_path}/protocol/bluetooth/bgstack/ll/inc" "-I{build.gsdk_path}/hardware/board/inc" "-I{build.gsdk_path}/platform/bootloader" "-I{build.gsdk_path}/platform/bootloader/api" "-I{build.gsdk_path}/platform/CMSIS/Core/Include" "-I{build.gsdk_path}/platform/CMSIS/RTOS2/Include" "-I{build.gsdk_path}/hardware/driver/configuration_over_swo/inc" "-I{build.gsdk_path}/platform/driver/debug/inc" "-I{build.gsdk_path}/platform/service/device_init/inc" "-I{build.gsdk_path}/platform/emdrv/dmadrv/inc" "-I{build.gsdk_path}/platform/emdrv/common/inc" "-I{build.gsdk_path}/platform/emlib/inc" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/fem_util" "-I{build.gsdk_path}/util/third_party/freertos/cmsis/Include" "-I{build.gsdk_path}/util/third_party/freertos/kernel/include" "-I{build.gsdk_path}/util/third_party/freertos/kernel/portable/GCC/ARM_CM33_NTZ/non_secure" "-I{build.gsdk_path}/platform/emdrv/gpiointerrupt/inc" "-I{build.gsdk_path}/platform/service/hfxo_manager/inc" "-I{build.gsdk_path}/platform/driver/i2cspm/inc" "-I{build.gsdk_path}/platform/service/iostream/inc" "-I{build.gsdk_path}/platform/driver/leddrv/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/config" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/config/preset" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/inc" "-I{build.gsdk_path}/util/third_party/mbedtls/include" "-I{build.gsdk_path}/util/third_party/mbedtls/library" "-I{build.gsdk_path}/platform/service/mpu/inc" "-I{build.gsdk_path}/platform/emdrv/nvm3/inc" "-I{build.gsdk_path}/util/third_party/openthread/include" "-I{build.gsdk_path}/util/third_party/openthread/include/openthread" "-I{build.gsdk_path}/util/third_party/openthread/src/core" "-I{build.gsdk_path}/util/third_party/openthread/third_party/tcplp" "-I{build.gsdk_path}/util/third_party/openthread/examples/platforms" "-I{build.gsdk_path}/util/third_party/openthread/examples/platforms/utils" "-I{build.gsdk_path}/protocol/openthread/platform-abstraction/efr32" "-I{build.gsdk_path}/protocol/openthread/platform-abstraction/include" "-I{build.gsdk_path}/platform/peripheral/inc" "-I{build.gsdk_path}/platform/service/power_manager/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_psa_driver/inc" "-I{build.gsdk_path}/platform/driver/pwm/inc" "-I{build.gsdk_path}/platform/radio/rail_lib/common" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/ble" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/ieee802154" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/wmbus" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/zwave" "-I{build.gsdk_path}/platform/radio/rail_lib/chip/efr32/efr32xg2x" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/sidewalk" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/pa-conversions" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/pa-conversions/efr32xg24" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_power_manager_init" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_pti" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_rssi" "-I{build.gsdk_path}/platform/security/sl_component/se_manager/inc" "-I{build.gsdk_path}/platform/security/sl_component/se_manager/src" "-I{build.gsdk_path}/util/plugin/security_manager" "-I{build.gsdk_path}/util/silicon_labs/silabs_core/memory_manager" "-I{build.gsdk_path}/platform/common/toolchain/inc" "-I{build.gsdk_path}/platform/service/system/inc" "-I{build.gsdk_path}/platform/service/sleeptimer/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_protocol_crypto/src" "-I{build.gsdk_path}/platform/emdrv/spidrv/inc" "-I{build.gsdk_path}/platform/service/udelay/inc"

