SiliconLabs/arduino/boards.txt
xg24explorerkit_matter.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c++11 -std=gnu++17 -Wall -Wextra -fno-exceptions -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse -Wno-deprecated-declarations -Wno-maybe-uninitialized -Wno-missing-field-initializers -Wno-unused-parameter -Wno-cast-function-type -Wno-psabi -fno-strict-aliasing -fno-unwind-tables -fno-asynchronous-unwind-tables -fno-common -Wno-sign-compare --specs=nano.specs -g

xg24explorerkit_matter.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map={build.path}/{build.project_name}.map -Wl,--wrap=malloc -Wl,--wrap=free -Wl,--wrap=realloc -Wl,--wrap=calloc -Wl,--wrap=MemoryAlloc -Wl,--wrap=_malloc_r -Wl,--wrap=_realloc_r -Wl,--wrap=_free_r -Wl,--wrap=_calloc_r -Wl,--gc-sections

xg24explorerkit_matter.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys

xg24explorerkit_matter.build.ldscript={build.variant.path}/autogen/linkerfile.ld


##################################################################
# xG24 Explorer Kit (Matter) - with prebuilt GSDK and Matter stack
# OPN: brd2703a
##################################################################

xg24explorerkit_matter_precomp.name=xG24 Explorer Kit (Matter) (precomp)
xg24explorerkit_matter_precomp.upload.tool=simplicitycommander
xg24explorerkit_matter_precomp.upload.tool.default=simplicitycommander
xg24explorerkit_matter_precomp.upload.target=xg24explorerkit
xg24explorerkit_matter_precomp.upload.maximum_data_size=262144
xg24explorerkit_matter_precomp.upload.maximum_size=1572864
xg24explorerkit_matter_precomp.upload.protocol=jlink
xg24explorerkit_matter_precomp.upload.setup_command=
xg24explorerkit_matter_precomp.upload.use_1200bps_touch=false
xg24explorerkit_matter_precomp.upload.wait_for_upload_port=false
xg24explorerkit_matter_precomp.upload.native_usb=false
xg24explorerkit_matter_precomp.bootloader.tool=simplicitycommander
xg24explorerkit_matter_precomp.bootloader.tool.default=simplicitycommander
xg24explorerkit_matter_precomp.bootloader.file=xg24-explorer-kit-bootloader-storage-internal-single-512k.hex
xg24explorerkit_matter_precomp.build.mcu=cortex-m33
xg24explorerkit_matter_precomp.build.f_cpu=39000000
xg24explorerkit_matter_precomp.build.board=SILABS_XG24EXPLORERKIT_MATTER
xg24explorerkit_matter_precomp.build.core=silabs
xg24explorerkit_matter_precomp.build.variant=xg24explorerkit_matter_precomp
xg24explorerkit_matter_precomp.build.variant_system_lib=
xg24explorerkit_matter_precomp.gsdk_folder=gecko_sdk_4.3.2
xg24explorerkit_matter_precomp.matter_sdk_folder=matter_2.1.1
xg24explorerkit_matter_precomp.build.gsdk_path={build.variant.path}/gsdk/{gsdk_folder}
xg24explorerkit_matter_precomp.build.matter_sdk_path={build.variant.path}/gsdk/{matter_sdk_folder}
xg24explorerkit_matter_precomp.build.precompiled_gsdk="{build.variant.path}/gsdk/gsdk.a"

xg24explorerkit_matter_precomp.build.include_list="-I{build.variant.path}/gsdk" "-I{build.variant.path}/gsdk/autogen/zap-generated" "-I{build.variant.path}/gsdk/autogen/zap-generated/app" "-I{build.variant.path}/gsdk/config" "-I{build.variant.path}/gsdk/config/btconf" "-I{build.variant.path}/gsdk/config/common" "-I{build.variant.path}/gsdk/autogen" "-I{build.variant.path}/gsdk/include" "-I{build.matter_sdk_path}/examples/platform/silabs" "-I{build.matter_sdk_path}/src" "-I{build.matter_sdk_path}/src/include" "-I{build.matter_sdk_path}/src/lib" "-I{build.matter_sdk_path}/third_party/nlassert/repo/include" "-I{build.matter_sdk_path}/third_party/nlio/repo/include" "-I{build.matter_sdk_path}/zzz_generated/app-common" "-I{build.matter_sdk_path}/slc/inc" "-I{build.matter_sdk_path}/examples/platform/silabs/efr32" "-I{build.matter_sdk_path}/src/platform/silabs/efr32" "-I{build.matter_sdk_path}/examples/providers" "-I{build.matter_sdk_path}/src/app/clusters/basic-information" "-I{build.matter_sdk_path}/src/app/clusters/color-control-server" "-I{build.matter_sdk_path}/src/app/clusters/diagnostic-logs-server" "-I{build.matter_sdk_path}/src/app/clusters/door-lock-server" "-I{build.matter_sdk_path}/src/app/clusters/general-commissioning-server" "-I{build.matter_sdk_path}/src/app/clusters/general-diagnostics-server" "-I{build.matter_sdk_path}/src/app/clusters/groups-server" "-I{build.matter_sdk_path}/src/app/clusters/identify-server" "-I{build.matter_sdk_path}/src/app/clusters/level-control" "-I{build.matter_sdk_path}/src/app/clusters/network-commissioning" "-I{build.matter_sdk_path}/src/app/clusters/occupancy-sensor-server" "-I{build.matter_sdk_path}/src/app/clusters/on-off-server" "-I{build.matter_sdk_path}/src/app/clusters/ota-requestor" "-I{build.matter_sdk_path}/third_party/silabs/gecko_sdk/util/third_party/segger/systemview/SEGGER" "-I{build.matter_sdk_path}/src/app/clusters/software-diagnostics-server" "-I{build.matter_sdk_path}/src/app/clusters/switch-server" "-I{build.matter_sdk_path}/src/app/clusters/window-covering-server" "-I{build.gsdk_path}/platform/Device/SiliconLabs/EFR32MG24/Include" "-I{build.gsdk_path}/app/common/util/app_assert" "-I{build.gsdk_path}/app/common/util/app_log" "-I{build.gsdk_path}/platform/common/inc" "-I{build.gsdk_path}/protocol/bluetooth/inc" "-I{build.gsdk_path}/protocol/bluetooth/bgstack/ll/inc" "-I{build.gsdk_path}/hardware/board/inc" "-I{build.gsdk_path}/platform/bootloader" "-I{build.gsdk_path}/platform/bootloader/api" "-I{build.gsdk_path}/platform/CMSIS/Core/Include" "-I{build.gsdk_path}/platform/CMSIS/RTOS2/Include" "-I{build.gsdk_path}/hardware/driver/configuration_over_swo/inc" "-I{build.gsdk_path}/platform/driver/debug/inc" "-I{build.gsdk_path}/platform/service/device_init/inc" "-I{build.gsdk_path}/platform/emdrv/dmadrv/inc" "-I{build.gsdk_path}/platform/emdrv/common/inc" "-I{build.gsdk_path}/platform/emlib/inc" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/fem_util" "-I{build.gsdk_path}/util/third_party/freertos/cmsis/Include" "-I{build.gsdk_path}/util/third_party/freertos/kernel/include" "-I{build.gsdk_path}/util/third_party/freertos/kernel/portable/GCC/ARM_CM33_NTZ/non_secure" "-I{build.gsdk_path}/platform/emdrv/gpiointerrupt/inc" "-I{build.gsdk_path}/platform/service/hfxo_manager/inc" "-I{build.gsdk_path}/platform/driver/i2cspm/inc" "-I{build.gsdk_path}/platform/service/iostream/inc" "-I{build.gsdk_path}/platform/driver/leddrv/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/config" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/config/preset" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/inc" "-I{build.gsdk_path}/util/third_party/mbedtls/include" "-I{build.gsdk_path}/util/third_party/mbedtls/library" "-I{build.gsdk_path}/platform/service/mpu/inc" "-I{build.gsdk_path}/platform/emdrv/nvm3/inc" "-I{build.gsdk_path}/util/third_party/openthread/include" "-I{build.gsdk_path}/util/third_party/openthread/include/openthread" "-I{build.gsdk_path}/util/third_party/openthread/src/core" "-I{build.gsdk_path}/util/third_party/openthread/third_party/tcplp" "-I{build.gsdk_path}/util/third_party/openthread/examples/platforms" "-I{build.gsdk_path}/util/third_party/openthread/examples/platforms/utils" "-I{build.gsdk_path}/protocol/openthread/platform-abstraction/efr32" "-I{build.gsdk_path}/protocol/openthread/platform-abstraction/include" "-I{build.gsdk_path}/platform/peripheral/inc" "-I{build.gsdk_path}/platform/service/power_manager/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_psa_driver/inc" "-I{build.gsdk_path}/platform/driver/pwm/inc" "-I{build.gsdk_path}/platform/radio/rail_lib/common" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/ble" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/ieee802154" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/wmbus" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/zwave" "-I{build.gsdk_path}/platform/radio/rail_lib/chip/efr32/efr32xg2x" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/sidewalk" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_built_in_phys/efr32xg24" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/pa-conversions" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/pa-conversions/efr32xg24" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_power_manager_init" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_pti" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_rssi" "-I{build.gsdk_path}/platform/security/sl_component/se_manager/inc" "-I{build.gsdk_path}/platform/security/sl_component/se_manager/src" "-I{build.gsdk_path}/util/plugin/security_manager" "-I{build.gsdk_path}/util/silicon_labs/silabs_core/memory_manager" "-I{build.gsdk_path}/platform/common/toolchain/inc" "-I{build.gsdk_path}/platform/service/system/inc" "-I{build.gsdk_path}/platform/service/sleeptimer/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_protocol_crypto/src" "-I{build.gsdk_path}/platform/emdrv/spidrv/inc" "-I{build.gsdk_path}/platform/service/udelay/inc"

xg24explorerkit_matter_precomp.build.precompiled_libs="{build.variant.path}/gsdk/libbluetooth.a" "{build.variant.path}/gsdk/libnvm3_CM33_gcc.a" "{build.variant.path}/gsdk/libsl_openthread_efr32mg2x_gcc.a" "{build.variant.path}/gsdk/librail_multiprotocol_efr32xg24_gcc_release.a"

