SiliconLabs/arduino/boards.txt
xg27devkit.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c++11 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

xg27devkit.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map={build.path}/{build.project_name}.map -Wl,--gc-sections

xg27devkit.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

xg27devkit.build.ldscript={build.variant.path}/autogen/linkerfile.ld


############################################
# xG27 Dev Kit (BLE) - with precompiled GSDK
# OPN: brd2602a
############################################

xg27devkit_precomp.name=xG27 Dev Kit (BLE) (precomp)
xg27devkit_precomp.upload.tool=simplicitycommander
xg27devkit_precomp.upload.tool.default=simplicitycommander
xg27devkit_precomp.upload.target=xg27devkit
xg27devkit_precomp.upload.maximum_data_size=65536
xg27devkit_precomp.upload.maximum_size=786432
xg27devkit_precomp.upload.protocol=jlink
xg27devkit_precomp.upload.setup_command=
xg27devkit_precomp.upload.use_1200bps_touch=false
xg27devkit_precomp.upload.wait_for_upload_port=false
xg27devkit_precomp.upload.native_usb=false
xg27devkit_precomp.bootloader.tool=simplicitycommander
xg27devkit_precomp.bootloader.tool.default=simplicitycommander
xg27devkit_precomp.bootloader.file=bg27-devkit-bootloader-apploader.hex
xg27devkit_precomp.build.mcu=cortex-m33
xg27devkit_precomp.build.f_cpu=76800000
xg27devkit_precomp.build.board=SILABS_XG27DEVKIT
xg27devkit_precomp.build.core=silabs
xg27devkit_precomp.build.variant=xg27devkit_precomp
xg27devkit_precomp.build.variant_system_lib=
xg27devkit_precomp.build.gsdk_path=
xg27devkit_precomp.build.precompiled_gsdk="{build.variant.path}/gsdk/gsdk.a"

xg27devkit_precomp.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/gsdk/include"

xg27devkit_precomp.build.precompiled_libs="{build.variant.path}/gsdk/libbluetooth.a" "{build.variant.path}/gsdk/libnvm3_CM33_gcc.a" "{build.variant.path}/gsdk/librail_efr32xg27_gcc_release.a"

xg27devkit_precomp.build.board_specific_macros='-DNUM_LEDS=1' '-DLED_BUILTIN=PA4' '-DNUM_BTN=1' '-DBTN_BUILTIN=PB3' '-DNUM_HW_SERIAL=2' '-DARDUINO_MAIN_TASK_STACK_SIZE=2048'

xg27devkit_precomp.build.extra_flags={build.board_specific_macros} '-DEFR32BG27C140F768IM40=1' '-DSL_APP_PROPERTIES=1' '-DBOOTLOADER_APPLOADER=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD2602A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=0' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1'

xg27devkit_precomp.build.float_flags=

xg27devkit_precomp.build.s_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -imacros sl_gcc_preinclude.h -x assembler-with-cpp -c -g

xg27devkit_precomp.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c99 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

xg27devkit_precomp.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c++11 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

xg27devkit_precomp.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map={build.path}/{build.project_name}.map -Wl,--gc-sections

xg27devkit_precomp.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

xg27devkit_precomp.build.ldscript={build.variant.path}/gsdk/linkerfile.ld


###########################
# BGM220 Explorer Kit (BLE)
# OPN: brd4314a
###########################

bgm220explorerkit.name=BGM220 Explorer Kit (BLE)
bgm220explorerkit.upload.tool=simplicitycommander
bgm220explorerkit.upload.tool.default=simplicitycommander
bgm220explorerkit.upload.target=bgm220explorerkit
bgm220explorerkit.upload.maximum_data_size=32768
bgm220explorerkit.upload.maximum_size=524288
bgm220explorerkit.upload.protocol=jlink
bgm220explorerkit.upload.setup_command=
bgm220explorerkit.upload.use_1200bps_touch=false
bgm220explorerkit.upload.wait_for_upload_port=false
bgm220explorerkit.upload.native_usb=false
bgm220explorerkit.bootloader.tool=simplicitycommander
bgm220explorerkit.bootloader.tool.default=simplicitycommander
bgm220explorerkit.bootloader.file=bgm220-explorer-kit-ble-bootloader-apploader.hex
bgm220explorerkit.build.mcu=cortex-m33
bgm220explorerkit.build.f_cpu=78000000
bgm220explorerkit.build.board=SILABS_BGM220EXPLORERKIT
bgm220explorerkit.build.core=silabs
bgm220explorerkit.build.variant=bgm220explorerkit
bgm220explorerkit.build.variant_system_lib=
bgm220explorerkit.gsdk_folder=gecko_sdk_4.3.2
bgm220explorerkit.build.gsdk_path={build.variant.path}/{gsdk_folder}
bgm220explorerkit.build.precompiled_gsdk=

bgm220explorerkit.build.include_list="-I{build.variant.path}/config" "-I{build.variant.path}/autogen" "-I{build.variant.path}" "-I{build.gsdk_path}/platform/Device/SiliconLabs/BGM22/Include" "-I{build.gsdk_path}/app/common/util/app_assert" "-I{build.gsdk_path}/app/common/util/app_log" "-I{build.gsdk_path}/protocol/bluetooth/inc" "-I{build.gsdk_path}/platform/common/inc" "-I{build.gsdk_path}/protocol/bluetooth/bgstack/ll/inc" "-I{build.gsdk_path}/hardware/board/inc" "-I{build.gsdk_path}/platform/bootloader" "-I{build.gsdk_path}/platform/bootloader/api" "-I{build.gsdk_path}/platform/CMSIS/Core/Include" "-I{build.gsdk_path}/platform/CMSIS/RTOS2/Include" "-I{build.gsdk_path}/hardware/driver/configuration_over_swo/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_cryptoacc_library/include" "-I{build.gsdk_path}/platform/security/sl_component/sl_cryptoacc_library/src" "-I{build.gsdk_path}/platform/driver/debug/inc" "-I{build.gsdk_path}/platform/service/device_init/inc" "-I{build.gsdk_path}/platform/emdrv/dmadrv/inc" "-I{build.gsdk_path}/platform/emdrv/common/inc" "-I{build.gsdk_path}/platform/emlib/inc" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/fem_util" "-I{build.gsdk_path}/util/third_party/freertos/cmsis/Include" "-I{build.gsdk_path}/util/third_party/freertos/kernel/include" "-I{build.gsdk_path}/util/third_party/freertos/kernel/portable/GCC/ARM_CM33_NTZ/non_secure" "-I{build.gsdk_path}/platform/driver/i2cspm/inc" "-I{build.gsdk_path}/platform/service/iostream/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/config" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/config/preset" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/inc" "-I{build.gsdk_path}/util/third_party/mbedtls/include" "-I{build.gsdk_path}/util/third_party/mbedtls/library" "-I{build.gsdk_path}/platform/service/mpu/inc" "-I{build.gsdk_path}/platform/emdrv/nvm3/inc" "-I{build.gsdk_path}/platform/service/power_manager/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_psa_driver/inc" "-I{build.gsdk_path}/platform/driver/pwm/inc" "-I{build.gsdk_path}/platform/radio/rail_lib/common" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/ble" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/ieee802154" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/wmbus" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/zwave" "-I{build.gsdk_path}/platform/radio/rail_lib/chip/efr32/efr32xg2x" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/sidewalk" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/pa-conversions" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/pa-conversions/efr32xg22" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_power_manager_init" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_pti" "-I{build.gsdk_path}/platform/security/sl_component/se_manager/inc" "-I{build.gsdk_path}/platform/security/sl_component/se_manager/src" "-I{build.gsdk_path}/util/silicon_labs/silabs_core/memory_manager" "-I{build.gsdk_path}/platform/common/toolchain/inc" "-I{build.gsdk_path}/platform/service/system/inc" "-I{build.gsdk_path}/platform/service/sleeptimer/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_protocol_crypto/src" "-I{build.gsdk_path}/platform/emdrv/spidrv/inc" "-I{build.gsdk_path}/platform/service/udelay/inc" "-I{build.gsdk_path}/platform/emdrv/gpiointerrupt/inc"

bgm220explorerkit.build.precompiled_libs="{build.gsdk_path}/protocol/bluetooth/lib/EFR32XG22/GCC/libbluetooth.a" "{build.gsdk_path}/platform/emdrv/nvm3/lib/libnvm3_CM33_gcc.a" "{build.gsdk_path}/platform/radio/rail_lib/autogen/librail_release/librail_config_bgm220pc22hna_gcc.a" "{build.gsdk_path}/platform/radio/rail_lib/autogen/librail_release/librail_module_efr32xg22_gcc_release.a"

bgm220explorerkit.build.board_specific_macros='-DNUM_LEDS=1' '-DLED_BUILTIN=PA4' '-DNUM_BTN=1' '-DBTN_BUILTIN=PC7' '-DNUM_HW_SERIAL=1' '-DNUM_HW_SPI=1' '-DARDUINO_MAIN_TASK_STACK_SIZE=256'

