SiliconLabs/arduino/boards.txt
bgm220explorerkit.build.extra_flags={build.board_specific_macros} '-DBGM220PC22HNA=1' '-DSL_APP_PROPERTIES=1' '-DBOOTLOADER_APPLOADER=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD4314A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=0' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1'

bgm220explorerkit.build.float_flags=

bgm220explorerkit.build.s_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -imacros sl_gcc_preinclude.h -x assembler-with-cpp -c -g

bgm220explorerkit.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c99 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

bgm220explorerkit.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c++11 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

bgm220explorerkit.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map={build.path}/{build.project_name}.map -Wl,--gc-sections

bgm220explorerkit.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

bgm220explorerkit.build.ldscript={build.variant.path}/autogen/linkerfile.ld


###################################################
# BGM220 Explorer Kit (BLE) - with precompiled GSDK
# OPN: brd4314a
###################################################

bgm220explorerkit_precomp.name=BGM220 Explorer Kit (BLE) (precomp)
bgm220explorerkit_precomp.upload.tool=simplicitycommander
bgm220explorerkit_precomp.upload.tool.default=simplicitycommander
bgm220explorerkit_precomp.upload.target=bgm220explorerkit
bgm220explorerkit_precomp.upload.maximum_data_size=32768
bgm220explorerkit_precomp.upload.maximum_size=524288
bgm220explorerkit_precomp.upload.protocol=jlink
bgm220explorerkit_precomp.upload.setup_command=
bgm220explorerkit_precomp.upload.use_1200bps_touch=false
bgm220explorerkit_precomp.upload.wait_for_upload_port=false
bgm220explorerkit_precomp.upload.native_usb=false
bgm220explorerkit_precomp.bootloader.tool=simplicitycommander
bgm220explorerkit_precomp.bootloader.tool.default=simplicitycommander
bgm220explorerkit_precomp.bootloader.file=bgm220-explorer-kit-ble-bootloader-apploader.hex
bgm220explorerkit_precomp.build.mcu=cortex-m33
bgm220explorerkit_precomp.build.f_cpu=78000000
bgm220explorerkit_precomp.build.board=SILABS_BGM220EXPLORERKIT
bgm220explorerkit_precomp.build.core=silabs
bgm220explorerkit_precomp.build.variant=bgm220explorerkit_precomp
bgm220explorerkit_precomp.build.variant_system_lib=
bgm220explorerkit_precomp.build.gsdk_path=
bgm220explorerkit_precomp.build.precompiled_gsdk="{build.variant.path}/gsdk/gsdk.a"

bgm220explorerkit_precomp.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/gsdk/include"

bgm220explorerkit_precomp.build.precompiled_libs="{build.variant.path}/gsdk/libbluetooth.a" "{build.variant.path}/gsdk/libnvm3_CM33_gcc.a" "{build.variant.path}/gsdk/librail_config_bgm220pc22hna_gcc.a" "{build.variant.path}/gsdk/librail_module_efr32xg22_gcc_release.a"

bgm220explorerkit_precomp.build.board_specific_macros='-DNUM_LEDS=1' '-DLED_BUILTIN=PA4' '-DNUM_BTN=1' '-DBTN_BUILTIN=PC7' '-DNUM_HW_SERIAL=1' '-DNUM_HW_SPI=1' '-DARDUINO_MAIN_TASK_STACK_SIZE=256'

bgm220explorerkit_precomp.build.extra_flags={build.board_specific_macros} '-DBGM220PC22HNA=1' '-DSL_APP_PROPERTIES=1' '-DBOOTLOADER_APPLOADER=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD4314A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=0' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1'

bgm220explorerkit_precomp.build.float_flags=

bgm220explorerkit_precomp.build.s_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -imacros sl_gcc_preinclude.h -x assembler-with-cpp -c -g

bgm220explorerkit_precomp.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c99 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

bgm220explorerkit_precomp.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c++11 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

bgm220explorerkit_precomp.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map={build.path}/{build.project_name}.map -Wl,--gc-sections

bgm220explorerkit_precomp.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

bgm220explorerkit_precomp.build.ldscript={build.variant.path}/gsdk/linkerfile.ld
